## Objectif : Nettoyage de données, analyse des données manquantes en vue d'une matrice "homogène et propre"

* Création d'un jeu de données avec des données manquantes
* Rechercher les données érronées ou manquantes

Pour un datascientist, ceci représente 80% de l'analyse, d'après IBM Data Analytics :  https://towardsdatascience.com/data-cleaning-with-python-and-pandas-detecting-missing-values-3e9c6ebcf78b

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#Contrusction d'un jeu de données avec des données manquantes
Data = {'PID':  ['100001000', '100002000', '100003000', '100004000',np.nan, '100006000', '100007000', '100008000', '100009000'],
        'ST_NUM': [104, 197,np.nan, 201, 203, 207, np.nan, 213, 215],
        'ST_NAME' : ['PUTNAM', 'LEXINGTON', 'LEXINGTON', 'BERKELEY', 'BERKELEY','BERKELEY', 'WASHINGTON', 'TREMONT', 'TREMONT'],
        'OWN_OCCUPIED': ['Y', 'N', 'N', 12, 'Y', 'Y',np.nan, 'Y', 'Y'],
        'NUM_BEDROOM': [3,3,'n/a', 1,3,np.nan, 2, '--', 'na'],
        'NUM_BATH': [1, 2, 1, np.nan, 2, 1, 'HURLEY', 1, 2],
        'SQ_FT': [1000, '--',  850, 700, 1600, 800, 950,'', 1800]
        }

In [ ]:
# Voir pour lire le fichier csv (car upload pb) sur le fichier properties.csv

In [ ]:
df=pd.DataFrame(Data)

In [ ]:
df

In [ ]:
df.dtypes

In [ ]:
#df['NUM_BATH2'] = pd.to_numeric(df.NUM_BATH, errors='coerce', downcast ='integer') 
#df

In [ ]:
#[x for x in df.NUM_BATH]

In [ ]:
#for x in df.NUM_BATH:
 #   if x != 1:
  #      print(x)

In [ ]:
# Regarder la colonne ST_NUM
df['ST_NUM'].isnull()

In [ ]:
# Regarder la colonne NUM_BEDROOM
df['NUM_BEDROOM'].isnull()

Que peut on dire sur les valeurs ?

In [ ]:
# Regardez la colonne OWN_OCCUPIED
df['OWN_OCCUPIED']

In [ ]:
df['OWN_OCCUPIED'].isnull()

Que remarquez vous ?

### Comment détecter les intrus ?

#### 1ere méthode (orienté programmation linéaire)
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In [ ]:
# 2eme méthode : basée sur la sélection mathématique
df.OWN_OCCUPIED[(df.OWN_OCCUPIED != 'Y') & (df.OWN_OCCUPIED != 'N')] = pd.np.nan

In [ ]:
df

In [ ]:
#df.NUM_BATH[(df.NUM_BATH != '1') & (df.NUM_BATH != '2')] = pd.np.nan

In [ ]:
# Avoir un résumé des données manquantes
df.isnull().sum()

### A vous de jouer :

Comment feriez vous pour rendre homogéne les trois dernières colonnes : NUM_BEDROOM, NUM_BATH et SQ_FT  ?

In [ ]:
# Voir pour créer une liste de valeurs 
df.NUM_BEDROOM[(df.NUM_BEDROOM != 1) & (df.NUM_BEDROOM != 2) & ((df.NUM_BEDROOM != 3))] = pd.np.nan

In [ ]:
df['NUM_BATH'] = pd.to_numeric(df.NUM_BATH, errors='coerce', downcast ='integer') 
df

In [ ]:
df.dtypes

In [81]:
df['SQ_FT'] = pd.to_numeric(df.SQ_FT, errors='coerce', downcast ='integer')
df

         PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOM  NUM_BATH   SQ_FT
0  100001000   104.0      PUTNAM            Y           3       1.0  1000.0
1  100002000   197.0   LEXINGTON            N           3       2.0     NaN
2  100003000     NaN   LEXINGTON            N         NaN       1.0   850.0
3  100004000   201.0    BERKELEY          NaN           1       NaN   700.0
4        NaN   203.0    BERKELEY            Y           3       2.0  1600.0
5  100006000   207.0    BERKELEY            Y         NaN       1.0   800.0
6  100007000     NaN  WASHINGTON          NaN           2       NaN   950.0
7  100008000   213.0     TREMONT            Y         NaN       1.0     NaN
8  100009000   215.0     TREMONT            Y         NaN       2.0  1800.0

In [82]:
df.NUM_BEDROOM[(~df.NUM_BEDROOM.isin([1, 2, 3]))] = pd.np.nan

/srv/conda/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [83]:
df.query('NUM_BEDROOM not in [1, 2, 3]')

         PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOM  NUM_BATH   SQ_FT
2  100003000     NaN  LEXINGTON            N         NaN       1.0   850.0
5  100006000   207.0   BERKELEY            Y         NaN       1.0   800.0
7  100008000   213.0    TREMONT            Y         NaN       1.0     NaN
8  100009000   215.0    TREMONT            Y         NaN       2.0  1800.0

In [84]:
df

         PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOM  NUM_BATH   SQ_FT
0  100001000   104.0      PUTNAM            Y           3       1.0  1000.0
1  100002000   197.0   LEXINGTON            N           3       2.0     NaN
2  100003000     NaN   LEXINGTON            N         NaN       1.0   850.0
3  100004000   201.0    BERKELEY          NaN           1       NaN   700.0
4        NaN   203.0    BERKELEY            Y           3       2.0  1600.0
5  100006000   207.0    BERKELEY            Y         NaN       1.0   800.0
6  100007000     NaN  WASHINGTON          NaN           2       NaN   950.0
7  100008000   213.0     TREMONT            Y         NaN       1.0     NaN
8  100009000   215.0     TREMONT            Y         NaN       2.0  1800.0

In [85]:
# Export de la matrice homogène et propre
df[['PID', 'ST_NUM', 'ST_NAME', 'OWN_OCCUPIED', 'NUM_BEDROOM']].to_csv('property_v1.csv')